// @ts-nocheck
// Recovered from code-analysis/decrypted/assets/main/index.b186b.js; module chunks:///_virtual/PlatFormData.ts
// Method bodies originate in this APK. TypeScript types and author formatting were not retained.
import { cclegacy as __rea_outer_t } from "cc";
let __recovered_export_0, __recovered_export_1;
__rea_outer_t._RF.push({}, "f66fa1pfZtDSIEHlAEI+QfR", "PlatFormData", void 0);
let a = __recovered_export_0 = function (_) {
  return _[_["首次加载"] = 1e4] = "首次加载", _[_["第一次进入游戏界面"] = 10001] = "第一次进入游戏界面", _[_["选关界面"] = 10002] = "选关界面", _[_["养成界面"] = 10003] = "养成界面", _[_["签到界面"] = 10004] = "签到界面", _[_["无限体力界面"] = 10005] = "无限体力界面", _[_["普通体力界面"] = 10006] = "普通体力界面", _[_["二十四小时全部解锁界面"] = 10007] = "二十四小时全部解锁界面", _[_["去侧边栏界面"] = 10008] = "去侧边栏界面", _[_["热门推荐界面"] = 10009] = "热门推荐界面", _[_["体力加号按钮"] = 20001] = "体力加号按钮", _[_["录屏按钮"] = 20002] = "录屏按钮", _[_["分享按钮"] = 20003] = "分享按钮", _[_["收藏按钮"] = 20004] = "收藏按钮", _[_["去侧边栏按钮"] = 20005] = "去侧边栏按钮", _[_["添加桌面按钮"] = 20006] = "添加桌面按钮", _[_["全部解锁按钮"] = 20007] = "全部解锁按钮", _[_["签到按钮"] = 20008] = "签到按钮", _[_["关卡跳过"] = 30001] = "关卡跳过", _[_["关卡加时"] = 30002] = "关卡加时", _[_["关卡提示"] = 30003] = "关卡提示", _[_["关卡答案"] = 30004] = "关卡答案", _[_["关卡失败后查看提示"] = 30005] = "关卡失败后查看提示", _[_["关卡增加时间"] = 30006] = "关卡增加时间", _[_["关卡下一关"] = 30007] = "关卡下一关", _[_["关卡失败返回"] = 30008] = "关卡失败返回", _[_["关卡失败重新开始"] = 30009] = "关卡失败重新开始", _[_["关卡看新家"] = 30010] = "关卡看新家", _[_["添加体力的界面_观看广告增加体力"] = 40001] = "添加体力的界面_观看广告增加体力", _[_["无限体力的界面_观看广告获得无限体力"] = 40002] = "无限体力的界面_观看广告获得无限体力", _[_["热门推荐_看视频进行游玩"] = 40003] = "热门推荐_看视频进行游玩", _[_["结算界面_热门推荐_看视频进行游玩"] = 40004] = "结算界面_热门推荐_看视频进行游玩", _[_["签到界面_看广告多倍奖励"] = 40005] = "签到界面_看广告多倍奖励", _[_["解锁关卡界面_看广告提前解锁一关"] = 40006] = "解锁关卡界面_看广告提前解锁一关", _[_["解锁关卡界面_看广告解锁全部_增加次数一次"] = 40007] = "解锁关卡界面_看广告解锁全部_增加次数一次", _[_["结算界面_看广告加时复活"] = 40008] = "结算界面_看广告加时复活", _[_["结算界面_看广告_获得提示复活"] = 40009] = "结算界面_看广告_获得提示复活", _[_["设置_暂停界面_看广告跳转关卡"] = 40010] = "设置_暂停界面_看广告跳转关卡", _[_["时间结束界面_看广告加时复活"] = 40011] = "时间结束界面_看广告加时复活", _[_["游戏界面_看广告加时间"] = 40012] = "游戏界面_看广告加时间", _[_["游戏界面_看广告获得_答案"] = 40013] = "游戏界面_看广告获得_答案", _[_["游戏界面_看广告跳过关卡"] = 40014] = "游戏界面_看广告跳过关卡", _[_["升级墙壁"] = 50001] = "升级墙壁", _[_["升级柜子"] = 50002] = "升级柜子", _[_["升级女儿"] = 50003] = "升级女儿", _[_["升级主角"] = 50004] = "升级主角", _[_["升级地毯"] = 50005] = "升级地毯", _[_["升级猫"] = 50006] = "升级猫", _[_["升级老鼠洞"] = 50007] = "升级老鼠洞", _[_["升级窗"] = 50008] = "升级窗", _[_["升级篝火"] = 50009] = "升级篝火", _[_["升级门"] = 50010] = "升级门", _[_["升级桌子"] = 50011] = "升级桌子", _[_["升级床"] = 50012] = "升级床", _[_["升级墙饰"] = 50013] = "升级墙饰", _[_["升级藏品"] = 50014] = "升级藏品", _;
}({});
__recovered_export_1 = {
  PlatData_MaiDian: a
};
__rea_outer_t._RF.pop();
export { __recovered_export_0 as PlatData_MaiDian, __recovered_export_1 as default };
